In [11]:
import pandas as pd
import numpy as np

In [12]:
import os.path
outdir="../data"

In [2]:
pop_saq=pd.read_excel("../data/pop-sexe-age-quinquennal6816.xls", sheet_name="COM_2016", skiprows=[i for i in range(13)], dtype={'CR':str})

In [3]:
try:
    #remove some a priori useless columns
    del(pop_saq['DR'])
    del(pop_saq['STABLE'])
except:
    pass

In [4]:
#Gather all the columns in a unique column with variables to describe them ('sex' and 'age')
pop_saq=pop_saq.melt(id_vars=['DR18','CR','RR','LIBELLE'])
tmp=pop_saq['variable'].str.extract(r'ageq_rec(?P<age>\d+)s(?P<sex>\d)rpop2016')
pop_saq=pd.concat([tmp,pop_saq],axis=1)
pop_saq['age']=(pd.to_numeric(pop_saq['age'])-1)*5 #counts for 5 years intervals of ages
pop_saq['sex']=pop_saq['sex'].astype(int)

In [5]:
del(tmp)
del(pop_saq['variable'])

In [6]:
#rename columns
pop_saq=pop_saq.rename(columns={'CR':'code', 'value':'pop', 'LIBELLE':'city_name', 'DR18':'dpt'})
pop_saq['city_name']=pop_saq['city_name'].str.lower()

In [7]:
pop_saq.head()

   age  sex dpt code  RR              city_name         pop
0    0    1  01  001  84  abergement-clémenciat   15.000000
1    0    1  01  002  84    abergement-de-varey    5.000000
2    0    1  01  003  84               amareins         NaN
3    0    1  01  004  84      ambérieu-en-bugey  529.591402
4    0    1  01  005  84    ambérieux-en-dombes   25.555140

* age: age quinquennal
* sex: sexe
* code: code commune INSEE
* city_name: nom commune
* dpt: departement code
* RR: region code
* pop: number of people with a given sex, age and dpt

In [13]:
pop_saq.to_csv( os.path.join(outdir,"pop.csv") )